In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import xlrd

In [250]:
#Reading data
#Export sheets from the .xlsx workbook into seperate datset
trans = pd.read_excel('KPMG_dataset.xlsx', sheet_name = "Transactions", engine = 'openpyxl')
newCus = pd.read_excel('KPMG_dataset.xlsx', sheet_name = "NewCustomerList", engine = 'openpyxl')
cusDemograph = pd.read_excel('KPMG_dataset.xlsx', sheet_name = "CustomerDemographic", engine = 'openpyxl')
address = pd.read_excel('KPMG_dataset.xlsx', sheet_name = "CustomerAddress", engine = 'openpyxl')

# remove the note from the dataset
trans = trans.rename(columns=trans.iloc[0])
newCus = newCus.rename(columns=newCus.iloc[0])
cusDemograph = cusDemograph.rename(columns=cusDemograph.iloc[0])
address= address.rename(columns=address.iloc[0])

In [164]:
trans = trans.iloc[:,0:13]

### Checking Correct Values in each Column in the Datasets ( Accuracy)

#### Transaction dataset

From my perspective through excel files, transaction_id', 'product_id', 'customer_id', 'transaction_date','online_order', 'order_status', 'product_line','product_class', 'product_size' columns have correct values. I will only experiment the remains columns.

In [82]:
trans.describe()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
count,20001,20001,20001,20001,19641,20001,19804,19804,19804,19804,20001.00,19804.00,19804
unique,20001,102,3495,365,3,3,7,5,4,4,297.00,104.00,101
top,transaction_id,0,2183,2017-02-14 00:00:00,True,Approved,Solex,Standard,medium,medium,2091.47,388.92,33879
freq,1,1378,14,82,9829,19821,4253,14176,13826,12990,465.00,465.00,234

*__From the table, I would say the transaction dataset has the correct Values in each Colums. However, I think it's missing the 'Profit' column.__*

In [232]:
trans['list_price'].value_counts()

2091.47    465
1403.50    396
71.49      274
1231.15    235
1890.39    233
          ...
1192.33      1
1184.00      1
1181.89      1
1150.59      1
2052.92      1
Name: list_price, Length: 297, dtype: int64

In [237]:
trans['standard_cost'].value_counts()

388.92           465
954.82           396
53.62            274
161.6            235
260.14           233
                ...
206.35           114
667.4000244        1
standard_cost      1
270.2999878        1
312.7350159        1
Name: standard_cost, Length: 104, dtype: int64

In [238]:
trans['product_first_sold_date'].value_counts()

33879                      234
41064                      229
37823                      227
39880                      222
38216                      220
                          ...
42404                      168
41922                      166
37659                      163
34586                      162
product_first_sold_date      1
Name: product_first_sold_date, Length: 101, dtype: int64

In [259]:
trans['online_order'].value_counts()

True            9829
False           9811
online_order       1
Name: online_order, dtype: int64

*__the 'product_first_sold_date' is not save in the date-time format__*

### Move to NewCus dataset

In [165]:
newCus.columns

Index([                         'first_name',
                                 'last_name',
                                    'gender',
       'past_3_years_bike_related_purchases',
                                       'DOB',
                                 'job_title',
                     'job_industry_category',
                            'wealth_segment',
                        'deceased_indicator',
                                  'owns_car',
                                    'tenure',
                                   'address',
                                  'postcode',
                                     'state',
                                   'country',
                        'property_valuation',
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                      'Rank',
                                     'Value'],
      dtype='object')

*__there are 5 nan columns__*

In [264]:
newCus1 = newCus.drop(newCus.columns[15:21], axis =1)
newCus1.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country', 'Rank',
       'Value'],
      dtype='object')

In [265]:
newCus1.describe()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,Rank,Value
count,1001,972,1001,1001,984,895,836,1001,1001,1001,1001,1001,1001,1001,1001,1001,1001.0000
unique,941,962,4,101,962,185,10,4,2,3,24,1001,523,4,2,325,325.0000
top,Mandie,Minshall,Female,60,1955-11-25,Associate Professor,Financial Services,Mass Customer,N,No,9,42681 Carey Alley,2145,NSW,Australia,760,0.6375
freq,3,2,513,20,2,15,203,508,1000,507,79,1,9,506,1000,13,13.0000

In [266]:
newCus1['gender'].value_counts()

Female    513
Male      470
U          17
gender      1
Name: gender, dtype: int64

In [235]:
newCus['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
wealth_segment         1
Name: wealth_segment, dtype: int64

In [236]:
newCus['property_valuation'].value_counts()

9                     173
8                     161
7                     136
10                    116
6                      69
11                     61
5                      57
4                      53
3                      51
12                     46
2                      42
1                      30
7                       2
property_valuation      1
11                      1
8                       1
6                       1
Name: property_valuation, dtype: int64

In [242]:
newCus['tenure'].value_counts()

9         79
13        74
11        68
10        63
12        61
7         60
5         60
17        59
15        58
8         55
14        54
16        49
6         45
4         36
18        36
19        34
3         26
21        24
20        22
2         15
22        12
1          8
0          2
tenure     1
Name: tenure, dtype: int64

### CustomerDemographic

In [239]:
cusDemograph.columns

Index([                        'customer_id',
                                'first_name',
                                 'last_name',
                                    'gender',
       'past_3_years_bike_related_purchases',
                                       'DOB',
                                 'job_title',
                     'job_industry_category',
                            'wealth_segment',
                        'deceased_indicator',
                                   'default',
                                  'owns_car',
                                    'tenure',
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan,
                                         nan],
      dtype='object')

In [241]:
cusDemograph = cusDemograph.iloc[:,0:13]
cusDemograph.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [243]:
cusDemograph.describe()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
count,4001,4001,3876,4001,4001,3914,3495,3345,4001,4001,3699,4001,3914
unique,4001,3140,3726,7,101,3449,196,10,4,3,91,3,23
top,customer_id,Timmie,Ramsdell,Female,19,1978-01-30 00:00:00,Business Systems Development Analyst,Manufacturing,Mass Customer,N,100,Yes,7
freq,1,5,3,2037,56,7,45,799,2000,3998,113,2024,235

### CustomerAddress dataset

In [251]:
address = address.iloc[:,0:6]
address.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [253]:
address.describe()

,customer_id,address,postcode,state,country,property_valuation
count,4000,4000,4000,4000,4000,4000
unique,4000,3997,874,6,2,13
top,customer_id,3 Talisman Place,2170,NSW,Australia,9
freq,1,2,31,2054,3999,647

### Checking Null Values ( Completeness) among all datasets.

In [67]:
# checking nulls
trans.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [77]:
newCus.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
NaN                                      1
NaN                                      1
NaN                                      1
NaN                                      1
NaN                                      1
Rank                                     0
Value                                    0
dtype: int64

In [267]:
cusDemograph.isnull().sum()

customer_id                               0
first_name                                0
last_name                               125
gender                                    0
past_3_years_bike_related_purchases       0
DOB                                      87
job_title                               506
job_industry_category                   656
wealth_segment                            0
deceased_indicator                        0
default                                 302
owns_car                                  0
tenure                                   87
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
NaN                                    4001
dtype: int64

In [268]:
address.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

### Checking consistency

In [269]:
print(trans.dtypes)

transaction_id              object
product_id                  object
customer_id                 object
transaction_date            object
online_order                object
order_status                object
brand                       object
product_line                object
product_class               object
product_size                object
list_price                  object
standard_cost               object
product_first_sold_date     object
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
NaN                        float64
dtype: object

In [270]:
print(newCus1.dtypes)

first_name                             object
last_name                              object
gender                                 object
past_3_years_bike_related_purchases    object
DOB                                    object
job_title                              object
job_industry_category                  object
wealth_segment                         object
deceased_indicator                     object
owns_car                               object
tenure                                 object
address                                object
postcode                               object
state                                  object
country                                object
Rank                                   object
Value                                  object
dtype: object

In [271]:
print(cusDemograph.dtypes)

customer_id                             object
first_name                              object
last_name                               object
gender                                  object
past_3_years_bike_related_purchases     object
DOB                                     object
job_title                               object
job_industry_category                   object
wealth_segment                          object
deceased_indicator                      object
default                                 object
owns_car                                object
tenure                                  object
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
NaN                                    float64
dtype: object

In [273]:
print(newCus1['postcode'].value_counts()[4000])

5

In [274]:
cusDemograph['gender'].value_counts()

Female    2037
Male      1872
U           88
M            1
Femal        1
F            1
gender       1
Name: gender, dtype: int64

In [275]:
cusDemograph['default'].value_counts()

100                                       113
1                                         112
-1                                        111
-100                                       99
â°â´âµâââ                                  53
                                         ...
/dev/null; touch /tmp/blns.fail ; echo     30
âªâªtestâª                                 29
ì¸ëë°í ë¥´                                 27
,ãã»:*:ã»ãâ( â» Ï â» )ãã»:*:ã»ãâ           25
default                                     1
Name: default, Length: 91, dtype: int64

### Checking Relevancy

In [276]:
trans['order_status'].value_counts()

Approved        19821
Cancelled         179
order_status        1
Name: order_status, dtype: int64

In [277]:
newCus['deceased_indicator'].value_counts()

N                     1000
deceased_indicator       1
Name: deceased_indicator, dtype: int64

### Checking Uniqueness

In [279]:
trans.nunique()

transaction_id             20001
product_id                   102
customer_id                 3495
transaction_date             365
online_order                   3
order_status                   3
brand                          7
product_line                   5
product_class                  4
product_size                   4
list_price                   297
standard_cost                104
product_first_sold_date      101
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
NaN                            0
dtype: int64

In [282]:
trans1 = trans.dropna()
print(trans1.duplicated().sum())

0

In [283]:
print(newCus1.duplicated().sum())

0

In [284]:
newCus1.nunique()

first_name                              941
last_name                               962
gender                                    4
past_3_years_bike_related_purchases     101
DOB                                     962
job_title                               185
job_industry_category                    10
wealth_segment                            4
deceased_indicator                        2
owns_car                                  3
tenure                                   24
address                                1001
postcode                                523
state                                     4
country                                   2
Rank                                    325
Value                                   325
dtype: int64

In [289]:
cusDemo = cusDemograph.dropna()
print(cusDemo.duplicated().sum())

0

In [293]:
address.duplicated().sum()

0